first_routes/app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "updated_at", "username") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2020-01-02 20:36:16.889140"], ["updated_at", "2020-01-02 20:36:16.889140"], ["username", "Oliver"]]
---
    def create
        user = User.new(user_params)

        if user.save